Revit 2027 API
FilteredWorksetIdIterator.IsDone Method
 Identifies if the iteration has completed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool IsDone()
Public Overridable Function IsDone As Boolean
public:
virtual bool IsDone()
abstract IsDone : unit -> bool
override IsDone : unit -> bool
Return Value
Boolean
 True if the iteration has no more matching worksets. False if there are more workset ids to be iterated.
Exceptions
Exception | Condition
InvalidOperationException |  The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator.
See Also
Reference
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace